[Killed] BlockStatement
tsepi/src/arrays/binarySearch.ts:11:68
  * Time: O(log N)
  * Space: O(1)
  */
-export default function binarySearch<T>(arr: T[], item: T): number {
-  let left = 0
-  let right = arr.length - 1
-
-  while (left <= right) {
-    const middle = Math.floor((left + right) / 2)
-    if (item === arr[middle]) {
-      return middle
-    } else if (item > arr[middle]) {
-      left = middle + 1
-    } else if (item < arr[middle]) {
-      right = middle - 1
-    }
-  }
-
-  return -1
-}
+export default function binarySearch<T>(arr: T[], item: T): number {}
 
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Timeout] ArithmeticOperator
tsepi/src/arrays/binarySearch.ts:13:15
  */
 export default function binarySearch<T>(arr: T[], item: T): number {
   let left = 0
-  let right = arr.length - 1
+  let right = arr.length + 1
 
   while (left <= right) {

[Timeout] ArithmeticOperator
tsepi/src/arrays/binarySearch.ts:16:32
   let right = arr.length - 1
 
   while (left <= right) {
-    const middle = Math.floor((left + right) / 2)
+    const middle = Math.floor((left - right) / 2)
     if (item === arr[middle]) {
       return middle

[Timeout] ArithmeticOperator
tsepi/src/arrays/binarySearch.ts:16:31
   let right = arr.length - 1
 
   while (left <= right) {
-    const middle = Math.floor((left + right) / 2)
+    const middle = Math.floor((left + right) * 2)
     if (item === arr[middle]) {
       return middle

[Killed] ConditionalExpression
tsepi/src/arrays/binarySearch.ts:17:9
 
   while (left <= right) {
     const middle = Math.floor((left + right) / 2)
-    if (item === arr[middle]) {
+    if (true) {
       return middle
     } else if (item > arr[middle]) {
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Timeout] BlockStatement
tsepi/src/arrays/binarySearch.ts:17:31
 
   while (left <= right) {
     const middle = Math.floor((left + right) / 2)
-    if (item === arr[middle]) {
-      return middle
-    } else if (item > arr[middle]) {
+    if (item === arr[middle]) {} else if (item > arr[middle]) {
       left = middle + 1
     } else if (item < arr[middle]) {

[Timeout] ConditionalExpression
tsepi/src/arrays/binarySearch.ts:19:16
     const middle = Math.floor((left + right) / 2)
     if (item === arr[middle]) {
       return middle
-    } else if (item > arr[middle]) {
+    } else if (false) {
       left = middle + 1
     } else if (item < arr[middle]) {

[Timeout] EqualityOperator
tsepi/src/arrays/binarySearch.ts:19:16
     const middle = Math.floor((left + right) / 2)
     if (item === arr[middle]) {
       return middle
-    } else if (item > arr[middle]) {
+    } else if (item <= arr[middle]) {
       left = middle + 1
     } else if (item < arr[middle]) {

[Timeout] ArithmeticOperator
tsepi/src/arrays/binarySearch.ts:20:14
     if (item === arr[middle]) {
       return middle
     } else if (item > arr[middle]) {
-      left = middle + 1
+      left = middle - 1
     } else if (item < arr[middle]) {
       right = middle - 1

[NoCoverage] ConditionalExpression
tsepi/src/arrays/binarySearch.ts:21:16
       return middle
     } else if (item > arr[middle]) {
       left = middle + 1
-    } else if (item < arr[middle]) {
+    } else if (false) {
       right = middle - 1
     }

[NoCoverage] EqualityOperator
tsepi/src/arrays/binarySearch.ts:21:16
       return middle
     } else if (item > arr[middle]) {
       left = middle + 1
-    } else if (item < arr[middle]) {
+    } else if (item >= arr[middle]) {
       right = middle - 1
     }

[NoCoverage] ArithmeticOperator
tsepi/src/arrays/binarySearch.ts:22:15
     } else if (item > arr[middle]) {
       left = middle + 1
     } else if (item < arr[middle]) {
-      right = middle - 1
+      right = middle + 1
     }
   }
