[Killed] BooleanLiteral
tsepi/src/btrees/traversal.ts:5:18
 
 function printInOrder<T>(btree: BTree<T>): T[] {
   let current: BTree<T> | undefined = btree
-  let leftDone = false
+  let leftDone = true
 
   const res = []
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/btrees/traversal.ts:10:9
   const res = []
 
   while (current) {
-    if (!leftDone) {
+    if (leftDone) {
       while (current.left) {
         current = current.left
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:10:9
   const res = []
 
   while (current) {
-    if (!leftDone) {
+    if (false) {
       while (current.left) {
         current = current.left
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:11:14
 
   while (current) {
     if (!leftDone) {
-      while (current.left) {
+      while (false) {
         current = current.left
       }
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Timeout] BlockStatement
tsepi/src/btrees/traversal.ts:11:28
 
   while (current) {
     if (!leftDone) {
-      while (current.left) {
-        current = current.left
-      }
+      while (current.left) {}
     }
 

[Timeout] BooleanLiteral
tsepi/src/btrees/traversal.ts:18:16
 
     res.push(current.value)
 
-    leftDone = true
+    leftDone = false
 
     if (current.right) {

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:20:9
 
     leftDone = true
 
-    if (current.right) {
+    if (false) {
       leftDone = false
       current = current.right
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:20:9
 
     leftDone = true
 
-    if (current.right) {
+    if (true) {
       leftDone = false
       current = current.right
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/btrees/traversal.ts:21:18
     leftDone = true
 
     if (current.right) {
-      leftDone = false
+      leftDone = true
       current = current.right
     } else if (current.root) {
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:23:16
     if (current.right) {
       leftDone = false
       current = current.right
-    } else if (current.root) {
+    } else if (false) {
       while (current.root && current === current.root.right) {
         current = current.root
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Survived] ConditionalExpression
tsepi/src/btrees/traversal.ts:23:16
     if (current.right) {
       leftDone = false
       current = current.right
-    } else if (current.root) {
+    } else if (true) {
       while (current.root && current === current.root.right) {
         current = current.root

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:24:30
       leftDone = false
       current = current.right
     } else if (current.root) {
-      while (current.root && current === current.root.right) {
+      while (current.root && true) {
         current = current.root
       }
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] LogicalOperator
tsepi/src/btrees/traversal.ts:24:14
       leftDone = false
       current = current.right
     } else if (current.root) {
-      while (current.root && current === current.root.right) {
+      while (current.root || current === current.root.right) {
         current = current.root
       }
killedBy: printInOrder
statusReason: TypeError: Cannot read properties of undefined (reading 'right')

[Killed] BooleanLiteral
tsepi/src/btrees/traversal.ts:28:11
         current = current.root
       }
 
-      if (!current.root) {
+      if (current.root) {
         break
       }
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/btrees/traversal.ts:28:11
         current = current.root
       }
 
-      if (!current.root) {
+      if (true) {
         break
       }
killedBy: printInOrder
statusReason: TypeError: result.message is not a function

[NoCoverage] BlockStatement
tsepi/src/btrees/traversal.ts:33:12
       }
 
       current = current.root
-    } else {
-      break
-    }
+    } else {}
   }
 
