[Killed] Regex
tsepi/src/hash_tables/anonymousLetter.ts:3:36
 import { filter, reduce } from '@/std'
 
-const letterOnlyRegex = new RegExp('[A-Za-z]')
+const letterOnlyRegex = new RegExp("[^A-Za-z]")
 
 function isLetter(ch: string) {
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:5:31
 
 const letterOnlyRegex = new RegExp('[A-Za-z]')
 
-function isLetter(ch: string) {
-  return letterOnlyRegex.test(ch)
-}
+function isLetter(ch: string) {}
 
 function splitText(text: string) {
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:9:34
   return letterOnlyRegex.test(ch)
 }
 
-function splitText(text: string) {
-  const allLetters = text.split('')
-  const onlyTextLetters = filter((ch) => {
-    return !!ch && isLetter(ch)
-  }, allLetters)
-  return onlyTextLetters
-}
+function splitText(text: string) {}
 
 function countLetters(letters: string[]) {
killedBy: anonymousLetter
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:11:42
 
 function splitText(text: string) {
   const allLetters = text.split('')
-  const onlyTextLetters = filter((ch) => {
-    return !!ch && isLetter(ch)
-  }, allLetters)
+  const onlyTextLetters = filter((ch) => {}, allLetters)
   return onlyTextLetters
 }
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/hash_tables/anonymousLetter.ts:12:12
 function splitText(text: string) {
   const allLetters = text.split('')
   const onlyTextLetters = filter((ch) => {
-    return !!ch && isLetter(ch)
+    return false
   }, allLetters)
   return onlyTextLetters
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/hash_tables/anonymousLetter.ts:12:13
 function splitText(text: string) {
   const allLetters = text.split('')
   const onlyTextLetters = filter((ch) => {
-    return !!ch && isLetter(ch)
+    return !ch && isLetter(ch)
   }, allLetters)
   return onlyTextLetters
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:17:42
   return onlyTextLetters
 }
 
-function countLetters(letters: string[]) {
-  return reduce(
-    (acc, ch) => {
-      if (!acc[ch]) {
-        acc[ch] = 1
-      }
-      acc[ch] += 1
-      return acc
-    },
-    letters,
-    {} as { [key: string]: number },
-  )
-}
+function countLetters(letters: string[]) {}
 
 export default function anonymousLetter(
killedBy: anonymousLetter
statusReason: TypeError: Cannot read properties of undefined (reading 'a')

[Killed] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:19:18
 
 function countLetters(letters: string[]) {
   return reduce(
-    (acc, ch) => {
-      if (!acc[ch]) {
-        acc[ch] = 1
-      }
-      acc[ch] += 1
-      return acc
-    },
+    (acc, ch) => {},
     letters,
     {} as { [key: string]: number },
killedBy: anonymousLetter
statusReason: TypeError: Cannot read properties of undefined (reading 'a')

[Survived] ConditionalExpression
tsepi/src/hash_tables/anonymousLetter.ts:20:11
 function countLetters(letters: string[]) {
   return reduce(
     (acc, ch) => {
-      if (!acc[ch]) {
+      if (false) {
         acc[ch] = 1
       }

[Survived] ConditionalExpression
tsepi/src/hash_tables/anonymousLetter.ts:20:11
 function countLetters(letters: string[]) {
   return reduce(
     (acc, ch) => {
-      if (!acc[ch]) {
+      if (true) {
         acc[ch] = 1
       }

[Survived] AssignmentOperator
tsepi/src/hash_tables/anonymousLetter.ts:23:7
       if (!acc[ch]) {
         acc[ch] = 1
       }
-      acc[ch] += 1
+      acc[ch] -= 1
       return acc
     },

[Killed] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:34:12
 export default function anonymousLetter(
   letter: string,
   magazine: string,
-): boolean {
-  const letterLetters = splitText(letter)
-  const magazineLetters = splitText(magazine)
-
-  if (letterLetters.length > magazineLetters.length) {
-    return false
-  }
-
-  const llc = countLetters(letterLetters)
-  const mmc = countLetters(magazineLetters)
-
-  for (const ch of letterLetters) {
-    if (llc[ch] > mmc[ch]) {
-      return false
-    }
-  }
-
-  return true
-}
+): boolean {}
 
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/hash_tables/anonymousLetter.ts:38:7
   const letterLetters = splitText(letter)
   const magazineLetters = splitText(magazine)
 
-  if (letterLetters.length > magazineLetters.length) {
+  if (letterLetters.length >= magazineLetters.length) {
     return false
   }
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/hash_tables/anonymousLetter.ts:38:7
   const letterLetters = splitText(letter)
   const magazineLetters = splitText(magazine)
 
-  if (letterLetters.length > magazineLetters.length) {
+  if (true) {
     return false
   }
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/hash_tables/anonymousLetter.ts:39:12
   const magazineLetters = splitText(magazine)
 
   if (letterLetters.length > magazineLetters.length) {
-    return false
+    return true
   }
 
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Survived] BlockStatement
tsepi/src/hash_tables/anonymousLetter.ts:45:35
   const llc = countLetters(letterLetters)
   const mmc = countLetters(magazineLetters)
 
-  for (const ch of letterLetters) {
-    if (llc[ch] > mmc[ch]) {
-      return false
-    }
-  }
+  for (const ch of letterLetters) {}
 
   return true

[Killed] EqualityOperator
tsepi/src/hash_tables/anonymousLetter.ts:46:9
   const mmc = countLetters(magazineLetters)
 
   for (const ch of letterLetters) {
-    if (llc[ch] > mmc[ch]) {
+    if (llc[ch] >= mmc[ch]) {
       return false
     }
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/hash_tables/anonymousLetter.ts:46:9
   const mmc = countLetters(magazineLetters)
 
   for (const ch of letterLetters) {
-    if (llc[ch] > mmc[ch]) {
+    if (llc[ch] <= mmc[ch]) {
       return false
     }
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[NoCoverage] BooleanLiteral
tsepi/src/hash_tables/anonymousLetter.ts:47:14
 
   for (const ch of letterLetters) {
     if (llc[ch] > mmc[ch]) {
-      return false
+      return true
     }
   }
