[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:16:45
    * Time: O(P)
    * Space: O(1)
    */
-  public insert(value: T, position: number) {
-    const newNode = new LNode(value)
-
-    if (position === 0) {
-      newNode.next = this.head
-      this.head = newNode
-      return
-    }
-
-    if (!this.head) {
-      throw new Error('index out of range error')
-    }
-
-    let i = 0
-    let current: LNode<T> | undefined = this.head
-    let prev: LNode<T> = current
-    while (current && i < position) {
-      i += 1
-      prev = current
-      current = current.next
-    }
-
-    prev.next = newNode
-    newNode.next = current
-  }
+  public insert(value: T, position: number) {}
 
   /**
killedBy: LinkedList insert
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:19:25
   public insert(value: T, position: number) {
     const newNode = new LNode(value)
 
-    if (position === 0) {
-      newNode.next = this.head
-      this.head = newNode
-      return
-    }
+    if (position === 0) {}
 
     if (!this.head) {
killedBy: LinkedList insert
statusReason: Error: index out of range error

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:25:9
       return
     }
 
-    if (!this.head) {
+    if (true) {
       throw new Error('index out of range error')
     }
killedBy: LinkedList insert
statusReason: Error: index out of range error

[Killed] BooleanLiteral
tsepi/src/lists/LinkedList.ts:25:9
       return
     }
 
-    if (!this.head) {
+    if (this.head) {
       throw new Error('index out of range error')
     }
killedBy: LinkedList insert
statusReason: Error: index out of range error

[Timeout] EqualityOperator
tsepi/src/lists/LinkedList.ts:32:23
     let i = 0
     let current: LNode<T> | undefined = this.head
     let prev: LNode<T> = current
-    while (current && i < position) {
+    while (current && i >= position) {
       i += 1
       prev = current

[Timeout] ConditionalExpression
tsepi/src/lists/LinkedList.ts:32:12
     let i = 0
     let current: LNode<T> | undefined = this.head
     let prev: LNode<T> = current
-    while (current && i < position) {
+    while (false) {
       i += 1
       prev = current

[Survived] AssignmentOperator
tsepi/src/lists/LinkedList.ts:33:7
     let current: LNode<T> | undefined = this.head
     let prev: LNode<T> = current
     while (current && i < position) {
-      i += 1
+      i -= 1
       prev = current
       current = current.next

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:51:28
    * Time: O(1)
    * Space: O(1)
    */
-  public prepend(value: T) {
-    this.insert(value, 0)
-  }
+  public prepend(value: T) {}
 
   /**
killedBy: MaxStack should support basic operations
statusReason: Error: StackIsEmptyError

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:64:27
    * Time: O(N)
    * Space: O(1)
    */
-  public append(value: T) {
-    const newNode = new LNode(value)
-    const lastNode = this.last()
-    if (!lastNode) {
-      this.head = newNode
-      return
-    }
-    lastNode.next = newNode
-  }
+  public append(value: T) {}
 
   public remove(position: number) {
killedBy: LinkedList append
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:67:9
   public append(value: T) {
     const newNode = new LNode(value)
     const lastNode = this.last()
-    if (!lastNode) {
+    if (true) {
       this.head = newNode
       return
killedBy: LinkedList append
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:67:9
   public append(value: T) {
     const newNode = new LNode(value)
     const lastNode = this.last()
-    if (!lastNode) {
+    if (false) {
       this.head = newNode
       return
killedBy: LinkedList append
statusReason: TypeError: Cannot set properties of undefined (setting 'next')

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:74:35
     lastNode.next = newNode
   }
 
-  public remove(position: number) {
-    if (!this.head) {
-      throw new Error('No head')
-    }
-
-    if (position === 0) {
-      this.head = this.head.next
-      return
-    }
-
-    const node = this.index(position)
-    if (node && node.next) {
-      node.next = node.next.next
-    }
-  }
+  public remove(position: number) {}
 
   /**
killedBy: MaxStack should support basic operations
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/lists/LinkedList.ts:75:9
   }
 
   public remove(position: number) {
-    if (!this.head) {
+    if (this.head) {
       throw new Error('No head')
     }
killedBy: MaxStack should support basic operations
statusReason: Error: No head

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:75:9
   }
 
   public remove(position: number) {
-    if (!this.head) {
+    if (true) {
       throw new Error('No head')
     }
killedBy: MaxStack should support basic operations
statusReason: Error: No head

[NoCoverage] ConditionalExpression
tsepi/src/lists/LinkedList.ts:85:9
     }
 
     const node = this.index(position)
-    if (node && node.next) {
+    if (false) {
       node.next = node.next.next
     }

[NoCoverage] ConditionalExpression
tsepi/src/lists/LinkedList.ts:85:9
     }
 
     const node = this.index(position)
-    if (node && node.next) {
+    if (true) {
       node.next = node.next.next
     }

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:99:56
    * Time: O(N)
    * Space: O(1)
    */
-  public index(position: number): LNode<T> | undefined {
-    if (position === 0) {
-      return this.head
-    }
-
-    let i = 0
-    let current = this.head
-    if (!current) {
-      throw new Error('Index out of range')
-    }
-
-    while (i < position) {
-      i += 1
-      if (!current.next) {
-        break
-      }
-      current = current.next
-    }
-
-    return current
-  }
+  public index(position: number): LNode<T> | undefined {}
 
   /**
killedBy: LinkedList index
statusReason: TypeError: done.fail is not a function

[Killed] EqualityOperator
tsepi/src/lists/LinkedList.ts:100:9
    * Space: O(1)
    */
   public index(position: number): LNode<T> | undefined {
-    if (position === 0) {
+    if (position !== 0) {
       return this.head
     }
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:100:9
    * Space: O(1)
    */
   public index(position: number): LNode<T> | undefined {
-    if (position === 0) {
+    if (true) {
       return this.head
     }
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:106:9
 
     let i = 0
     let current = this.head
-    if (!current) {
+    if (true) {
       throw new Error('Index out of range')
     }
killedBy: LinkedList index
statusReason: Error: Index out of range

[Killed] BooleanLiteral
tsepi/src/lists/LinkedList.ts:106:9
 
     let i = 0
     let current = this.head
-    if (!current) {
+    if (current) {
       throw new Error('Index out of range')
     }
killedBy: LinkedList index
statusReason: Error: Index out of range

[Killed] EqualityOperator
tsepi/src/lists/LinkedList.ts:110:12
       throw new Error('Index out of range')
     }
 
-    while (i < position) {
+    while (i <= position) {
       i += 1
       if (!current.next) {
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/lists/LinkedList.ts:110:12
       throw new Error('Index out of range')
     }
 
-    while (i < position) {
+    while (i >= position) {
       i += 1
       if (!current.next) {
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] AssignmentOperator
tsepi/src/lists/LinkedList.ts:111:7
     }
 
     while (i < position) {
-      i += 1
+      i -= 1
       if (!current.next) {
         break
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/lists/LinkedList.ts:112:11
 
     while (i < position) {
       i += 1
-      if (!current.next) {
+      if (current.next) {
         break
       }
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:112:11
 
     while (i < position) {
       i += 1
-      if (!current.next) {
+      if (true) {
         break
       }
killedBy: LinkedList index
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:128:39
    * Time: O(N)
    * Space: O(1)
    */
-  public last(): LNode<T> | undefined {
-    let current = this.head
-
-    if (!current) {
-      return
-    }
-
-    while (current && current.next) {
-      current = current.next
-    }
-
-    return current
-  }
+  public last(): LNode<T> | undefined {}
 
   public toArray(): T[] {
killedBy: LinkedList append
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/lists/LinkedList.ts:131:9
   public last(): LNode<T> | undefined {
     let current = this.head
 
-    if (!current) {
+    if (current) {
       return
     }
killedBy: LinkedList append
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:131:9
   public last(): LNode<T> | undefined {
     let current = this.head
 
-    if (!current) {
+    if (true) {
       return
     }
killedBy: LinkedList append
statusReason: TypeError: result.message is not a function

[Killed] LogicalOperator
tsepi/src/lists/LinkedList.ts:135:12
       return
     }
 
-    while (current && current.next) {
+    while (current || current.next) {
       current = current.next
     }
killedBy: LinkedList append
statusReason: TypeError: Cannot read properties of undefined (reading 'next')

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:135:12
       return
     }
 
-    while (current && current.next) {
+    while (false) {
       current = current.next
     }
killedBy: LinkedList append
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:142:25
     return current
   }
 
-  public toArray(): T[] {
-    if (!this.head) {
-      return []
-    }
-    return toArray(this.head)
-  }
+  public toArray(): T[] {}
 }
 
killedBy: LinkedList toArray
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:143:9
   }
 
   public toArray(): T[] {
-    if (!this.head) {
+    if (true) {
       return []
     }
killedBy: LinkedList toArray
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/lists/LinkedList.ts:143:9
   }
 
   public toArray(): T[] {
-    if (!this.head) {
+    if (this.head) {
       return []
     }
killedBy: LinkedList toArray
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:157:55
  * Time: O(N)
  * Space: O(N)
  */
-export function fromArray<T>(arr: T[]): LinkedList<T> {
-  const ll = new LinkedList<T>()
-
-  for (let i = arr.length - 1; i >= 0; i -= 1) {
-    const v = arr[i]
-    ll.prepend(v)
-  }
-
-  return ll
-}
+export function fromArray<T>(arr: T[]): LinkedList<T> {}
 
 /**
killedBy: fromArray
statusReason: TypeError: Cannot read properties of undefined (reading 'head')

[Killed] EqualityOperator
tsepi/src/lists/LinkedList.ts:160:32
 export function fromArray<T>(arr: T[]): LinkedList<T> {
   const ll = new LinkedList<T>()
 
-  for (let i = arr.length - 1; i >= 0; i -= 1) {
+  for (let i = arr.length - 1; i > 0; i -= 1) {
     const v = arr[i]
     ll.prepend(v)
killedBy: fromArray
statusReason: TypeError: result.message is not a function

[Survived] ConditionalExpression
tsepi/src/lists/LinkedList.ts:160:32
 export function fromArray<T>(arr: T[]): LinkedList<T> {
   const ll = new LinkedList<T>()
 
-  for (let i = arr.length - 1; i >= 0; i -= 1) {
+  for (let i = arr.length - 1; false; i -= 1) {
     const v = arr[i]
     ll.prepend(v)

[Killed] BlockStatement
tsepi/src/lists/LinkedList.ts:175:49
  * Time: O(N)
  * Space: O(N)
  */
-export function toArray<T>(head: LNode<T>): T[] {
-  const res: T[] = []
-
-  let current: LNode<T> | undefined = head
-  while (current) {
-    res.push(current.value)
-    current = current.next
-  }
-
-  return res
-}
+export function toArray<T>(head: LNode<T>): T[] {}
 
killedBy: LinkedList toArray
statusReason: TypeError: result.message is not a function

[Killed] ArrayDeclaration
tsepi/src/lists/LinkedList.ts:176:20
  * Space: O(N)
  */
 export function toArray<T>(head: LNode<T>): T[] {
-  const res: T[] = []
+  const res: T[] = ["Stryker was here"]
 
   let current: LNode<T> | undefined = head
killedBy: LinkedList toArray
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/LinkedList.ts:179:10
   const res: T[] = []
 
   let current: LNode<T> | undefined = head
-  while (current) {
+  while (false) {
     res.push(current.value)
     current = current.next
killedBy: LinkedList toArray
statusReason: TypeError: result.message is not a function

[Timeout] BlockStatement
tsepi/src/lists/LinkedList.ts:179:19
   const res: T[] = []
 
   let current: LNode<T> | undefined = head
-  while (current) {
-    res.push(current.value)
-    current = current.next
-  }
+  while (current) {}
 
   return res
