[Killed] LogicalOperator
tsepi/src/lists/mergeSorted.ts:17:10
   const res = {} as LNode<T>
   let cr = res
 
-  while (cur1 || cur2) {
+  while (cur1 && cur2) {
     if (cur1 && cur2) {
       if (cur1.value <= cur2.value) {
killedBy: mergeSorted should return empty list for empty input
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/mergeSorted.ts:17:10
   const res = {} as LNode<T>
   let cr = res
 
-  while (cur1 || cur2) {
+  while (false) {
     if (cur1 && cur2) {
       if (cur1.value <= cur2.value) {
killedBy: mergeSorted should return empty list for empty input
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/lists/mergeSorted.ts:18:9
   let cr = res
 
   while (cur1 || cur2) {
-    if (cur1 && cur2) {
+    if (true) {
       if (cur1.value <= cur2.value) {
         cr.next = new LNode(cur1.value)
killedBy: mergeSorted should return empty list for empty input
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] LogicalOperator
tsepi/src/lists/mergeSorted.ts:18:9
   let cr = res
 
   while (cur1 || cur2) {
-    if (cur1 && cur2) {
+    if (cur1 || cur2) {
       if (cur1.value <= cur2.value) {
         cr.next = new LNode(cur1.value)
killedBy: mergeSorted should return empty list for empty input
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
tsepi/src/lists/mergeSorted.ts:19:11
 
   while (cur1 || cur2) {
     if (cur1 && cur2) {
-      if (cur1.value <= cur2.value) {
+      if (true) {
         cr.next = new LNode(cur1.value)
         cr = cr.next
killedBy: mergeSorted should merge two lists
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/lists/mergeSorted.ts:19:11
 
   while (cur1 || cur2) {
     if (cur1 && cur2) {
-      if (cur1.value <= cur2.value) {
+      if (cur1.value > cur2.value) {
         cr.next = new LNode(cur1.value)
         cr = cr.next
killedBy: mergeSorted should merge two lists
statusReason: TypeError: result.message is not a function

[Timeout] BlockStatement
tsepi/src/lists/mergeSorted.ts:23:14
         cr.next = new LNode(cur1.value)
         cr = cr.next
         cur1 = cur1.next
-      } else {
-        cr.next = new LNode(cur2.value)
-        cr = cr.next
-        cur2 = cur2.next
-      }
+      } else {}
     } else if (cur1) {
       cr.next = new LNode(cur1.value)

[Killed] ConditionalExpression
tsepi/src/lists/mergeSorted.ts:28:16
         cr = cr.next
         cur2 = cur2.next
       }
-    } else if (cur1) {
+    } else if (true) {
       cr.next = new LNode(cur1.value)
       cr = cr.next
killedBy: mergeSorted should return empty list for empty input
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[NoCoverage] BlockStatement
tsepi/src/lists/mergeSorted.ts:28:22
         cr = cr.next
         cur2 = cur2.next
       }
-    } else if (cur1) {
-      cr.next = new LNode(cur1.value)
-      cr = cr.next
-      cur1 = cur1.next
-    } else if (cur2) {
+    } else if (cur1) {} else if (cur2) {
       cr.next = new LNode(cur2.value)
       cr = cr.next

[Survived] ConditionalExpression
tsepi/src/lists/mergeSorted.ts:32:16
       cr.next = new LNode(cur1.value)
       cr = cr.next
       cur1 = cur1.next
-    } else if (cur2) {
+    } else if (true) {
       cr.next = new LNode(cur2.value)
       cr = cr.next

[Timeout] BlockStatement
tsepi/src/lists/mergeSorted.ts:32:22
       cr.next = new LNode(cur1.value)
       cr = cr.next
       cur1 = cur1.next
-    } else if (cur2) {
-      cr.next = new LNode(cur2.value)
-      cr = cr.next
-      cur2 = cur2.next
-    }
+    } else if (cur2) {}
   }
 
