[Killed] BlockStatement
tsepi/src/stack/MaxStack.ts:15:17
   private ll: LinkedList<T>
   private ml: LinkedList<T>
 
-  constructor() {
-    this.ll = new LinkedList()
-    this.ml = new LinkedList()
-  }
+  constructor() {}
 
   public push(item: T) {
killedBy: MaxStack should support basic operations
statusReason: TypeError: Cannot read properties of undefined (reading 'prepend')

[Killed] BlockStatement
tsepi/src/stack/MaxStack.ts:20:24
     this.ml = new LinkedList()
   }
 
-  public push(item: T) {
-    this.ll.prepend(item)
-
-    if (!this.ml.head) {
-      this.ml.prepend(item)
-      return
-    }
-
-    if (this.ml.head.value < item) {
-      this.ml.prepend(item)
-    } else {
-      this.ml.prepend(this.ml.head.value)
-    }
-  }
+  public push(item: T) {}
 
   public pop(): T {
killedBy: MaxStack should support basic operations
statusReason: Error: StackIsEmptyError

[Killed] ConditionalExpression
tsepi/src/stack/MaxStack.ts:23:9
   public push(item: T) {
     this.ll.prepend(item)
 
-    if (!this.ml.head) {
+    if (true) {
       this.ml.prepend(item)
       return
killedBy: MaxStack should support max list
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/stack/MaxStack.ts:23:9
   public push(item: T) {
     this.ll.prepend(item)
 
-    if (!this.ml.head) {
+    if (false) {
       this.ml.prepend(item)
       return
killedBy: MaxStack should support basic operations
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
tsepi/src/stack/MaxStack.ts:28:36
       return
     }
 
-    if (this.ml.head.value < item) {
-      this.ml.prepend(item)
-    } else {
+    if (this.ml.head.value < item) {} else {
       this.ml.prepend(this.ml.head.value)
     }
killedBy: MaxStack should support basic operations
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/stack/MaxStack.ts:28:9
       return
     }
 
-    if (this.ml.head.value < item) {
+    if (false) {
       this.ml.prepend(item)
     } else {
killedBy: MaxStack should support basic operations
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/stack/MaxStack.ts:30:12
 
     if (this.ml.head.value < item) {
       this.ml.prepend(item)
-    } else {
-      this.ml.prepend(this.ml.head.value)
-    }
+    } else {}
   }
 
killedBy: MaxStack should support max list
statusReason: Error: StackIsEmptyError

[Killed] BlockStatement
tsepi/src/stack/MaxStack.ts:35:19
     }
   }
 
-  public pop(): T {
-    if (!this.ll.head || !this.ml.head) {
-      throw new Error('StackIsEmptyError')
-    }
-
-    const value = this.ll.head.value
-    this.ll.remove(0)
-    this.ml.remove(0)
-
-    return value
-  }
+  public pop(): T {}
 
   public max(): T {
killedBy: MaxStack should support basic operations
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/stack/MaxStack.ts:36:9
   }
 
   public pop(): T {
-    if (!this.ll.head || !this.ml.head) {
+    if (true) {
       throw new Error('StackIsEmptyError')
     }
killedBy: MaxStack should support basic operations
statusReason: Error: StackIsEmptyError

[Killed] BooleanLiteral
tsepi/src/stack/MaxStack.ts:36:9
   }
 
   public pop(): T {
-    if (!this.ll.head || !this.ml.head) {
+    if (this.ll.head || !this.ml.head) {
       throw new Error('StackIsEmptyError')
     }
killedBy: MaxStack should support basic operations
statusReason: Error: StackIsEmptyError

[Killed] BlockStatement
tsepi/src/stack/MaxStack.ts:47:19
     return value
   }
 
-  public max(): T {
-    if (!this.ml.head) {
-      throw new Error('StackIsEmptyError')
-    }
-
-    return this.ml.head.value
-  }
+  public max(): T {}
 }
 
killedBy: MaxStack should support basic operations
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/stack/MaxStack.ts:48:9
   }
 
   public max(): T {
-    if (!this.ml.head) {
+    if (true) {
       throw new Error('StackIsEmptyError')
     }
killedBy: MaxStack should support basic operations
statusReason: Error: StackIsEmptyError

[Killed] BooleanLiteral
tsepi/src/stack/MaxStack.ts:48:9
   }
 
   public max(): T {
-    if (!this.ml.head) {
+    if (this.ml.head) {
       throw new Error('StackIsEmptyError')
     }
killedBy: MaxStack should support basic operations
statusReason: Error: StackIsEmptyError

[NoCoverage] StringLiteral
tsepi/src/stack/MaxStack.ts:49:23
 
   public max(): T {
     if (!this.ml.head) {
-      throw new Error('StackIsEmptyError')
+      throw new Error("")
     }
 
