[Killed] BlockStatement
tsepi/src/std/memo.ts:1:29
-function memo(fn: any): any {
-  const cache = new Map()
-
-  return (...args: any[]) => {
-    const key = args[0]
-    if (cache.has(key)) {
-      return cache.get(key)
-    }
-
-    const res = fn.apply(null, args)
-    cache.set(key, res)
-    return res
-  }
-}
+function memo(fn: any): any {}
 
 export default memo
killedBy: memo
statusReason: TypeError: testFn is not a function

[Killed] BlockStatement
tsepi/src/std/memo.ts:4:30
 function memo(fn: any): any {
   const cache = new Map()
 
-  return (...args: any[]) => {
-    const key = args[0]
-    if (cache.has(key)) {
-      return cache.get(key)
-    }
-
-    const res = fn.apply(null, args)
-    cache.set(key, res)
-    return res
-  }
+  return (...args: any[]) => {}
 }
 
killedBy: memo
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/std/memo.ts:6:9
 
   return (...args: any[]) => {
     const key = args[0]
-    if (cache.has(key)) {
+    if (true) {
       return cache.get(key)
     }
killedBy: memo
statusReason: TypeError: result.message is not a function

[NoCoverage] BlockStatement
tsepi/src/std/memo.ts:6:25
 
   return (...args: any[]) => {
     const key = args[0]
-    if (cache.has(key)) {
-      return cache.get(key)
-    }
+    if (cache.has(key)) {}
 
     const res = fn.apply(null, args)
