[NoCoverage] BlockStatement
tsepi/src/std/numbers.ts:1:55
-export function bin(x: number, size?: number): string {
-  let r = x.toString(2)
-  if (!size) {
-    return r
-  }
-
-  while (r.length < size) {
-    r = '0' + r
-  }
-
-  return r
-}
+export function bin(x: number, size?: number): string {}
 
 export function bin2dec(x: string): number {

[NoCoverage] BooleanLiteral
tsepi/src/std/numbers.ts:3:7
 export function bin(x: number, size?: number): string {
   let r = x.toString(2)
-  if (!size) {
+  if (size) {
     return r
   }

[NoCoverage] BlockStatement
tsepi/src/std/numbers.ts:3:14
 export function bin(x: number, size?: number): string {
   let r = x.toString(2)
-  if (!size) {
-    return r
-  }
+  if (!size) {}
 
   while (r.length < size) {

[NoCoverage] ConditionalExpression
tsepi/src/std/numbers.ts:7:10
     return r
   }
 
-  while (r.length < size) {
+  while (false) {
     r = '0' + r
   }

[NoCoverage] EqualityOperator
tsepi/src/std/numbers.ts:7:10
     return r
   }
 
-  while (r.length < size) {
+  while (r.length <= size) {
     r = '0' + r
   }

[NoCoverage] BlockStatement
tsepi/src/std/numbers.ts:14:44
   return r
 }
 
-export function bin2dec(x: string): number {
-  return parseInt(x, 2)
-}
+export function bin2dec(x: string): number {}
 
 export function hex(x: number): string {

[NoCoverage] BlockStatement
tsepi/src/std/numbers.ts:18:40
   return parseInt(x, 2)
 }
 
-export function hex(x: number): string {
-  return x.toString(16)
-}
+export function hex(x: number): string {}
 
 export function hex2dec(x: string): number {

[NoCoverage] BlockStatement
tsepi/src/std/numbers.ts:22:44
   return x.toString(16)
 }
 
-export function hex2dec(x: string): number {
-  return parseInt(x, 16)
-}
+export function hex2dec(x: string): number {}
 
