[Killed] BlockStatement
tsepi/src/arrays/rearrange.ts:15:50
  * Time: O(N)
  * Space: O(1)
  */
-function rearrange<T>(arr: T[], i: number): void {
-  const x = arr[i]
-  let [p, q, r] = [0, 0, arr.length - 1]
-  while (q <= r) {
-    if (arr[q] < x) {
-      swap(arr, q, p)
-      p += 1
-      q += 1
-    } else if (arr[q] > x) {
-      swap(arr, q, r)
-      r -= 1
-    } else {
-      q += 1
-    }
-  }
-}
+function rearrange<T>(arr: T[], i: number): void {}
 
 export default rearrange
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] ArithmeticOperator
tsepi/src/arrays/rearrange.ts:17:26
  */
 function rearrange<T>(arr: T[], i: number): void {
   const x = arr[i]
-  let [p, q, r] = [0, 0, arr.length - 1]
+  let [p, q, r] = [0, 0, arr.length + 1]
   while (q <= r) {
     if (arr[q] < x) {
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/arrays/rearrange.ts:18:10
 function rearrange<T>(arr: T[], i: number): void {
   const x = arr[i]
   let [p, q, r] = [0, 0, arr.length - 1]
-  while (q <= r) {
+  while (false) {
     if (arr[q] < x) {
       swap(arr, q, p)
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/arrays/rearrange.ts:18:10
 function rearrange<T>(arr: T[], i: number): void {
   const x = arr[i]
   let [p, q, r] = [0, 0, arr.length - 1]
-  while (q <= r) {
+  while (q > r) {
     if (arr[q] < x) {
       swap(arr, q, p)
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/arrays/rearrange.ts:19:9
   const x = arr[i]
   let [p, q, r] = [0, 0, arr.length - 1]
   while (q <= r) {
-    if (arr[q] < x) {
+    if (true) {
       swap(arr, q, p)
       p += 1
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/arrays/rearrange.ts:19:9
   const x = arr[i]
   let [p, q, r] = [0, 0, arr.length - 1]
   while (q <= r) {
-    if (arr[q] < x) {
+    if (arr[q] <= x) {
       swap(arr, q, p)
       p += 1
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] AssignmentOperator
tsepi/src/arrays/rearrange.ts:21:7
   while (q <= r) {
     if (arr[q] < x) {
       swap(arr, q, p)
-      p += 1
+      p -= 1
       q += 1
     } else if (arr[q] > x) {
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] AssignmentOperator
tsepi/src/arrays/rearrange.ts:22:7
     if (arr[q] < x) {
       swap(arr, q, p)
       p += 1
-      q += 1
+      q -= 1
     } else if (arr[q] > x) {
       swap(arr, q, r)
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/arrays/rearrange.ts:23:16
       swap(arr, q, p)
       p += 1
       q += 1
-    } else if (arr[q] > x) {
+    } else if (false) {
       swap(arr, q, r)
       r -= 1
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/arrays/rearrange.ts:23:16
       swap(arr, q, p)
       p += 1
       q += 1
-    } else if (arr[q] > x) {
+    } else if (true) {
       swap(arr, q, r)
       r -= 1
killedBy: rearrange
statusReason: TypeError: result.message is not a function

[Timeout] AssignmentOperator
tsepi/src/arrays/rearrange.ts:25:7
       q += 1
     } else if (arr[q] > x) {
       swap(arr, q, r)
-      r -= 1
+      r += 1
     } else {
       q += 1

[Timeout] BlockStatement
tsepi/src/arrays/rearrange.ts:26:12
     } else if (arr[q] > x) {
       swap(arr, q, r)
       r -= 1
-    } else {
-      q += 1
-    }
+    } else {}
   }
 }

[Killed] AssignmentOperator
tsepi/src/arrays/rearrange.ts:27:7
       swap(arr, q, r)
       r -= 1
     } else {
-      q += 1
+      q -= 1
     }
   }
killedBy: rearrange
statusReason: TypeError: result.message is not a function
