[Killed] BlockStatement
tsepi/src/btrees/BTree.ts:7:25
   public left: BTree<T> | undefined
   public right: BTree<T> | undefined
 
-  constructor(value: T) {
-    this.value = value
-  }
+  constructor(value: T) {}
 }
 
killedBy: printInOrder
statusReason: TypeError: result.message is not a function
