[Killed] BlockStatement
tsepi/src/primitives/countBits.ts:6:39
  * @param x - number
  * @return number of bits
  */
-function countBits(x: number): number {
-  let n = 0
-  while (x > 0) {
-    n += x & 1
-    x = x >> 1
-  }
-  return n
-}
+function countBits(x: number): number {}
 
 export default countBits
killedBy: countBits should count bits
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/primitives/countBits.ts:8:10
  */
 function countBits(x: number): number {
   let n = 0
-  while (x > 0) {
+  while (false) {
     n += x & 1
     x = x >> 1
killedBy: countBits should count bits
statusReason: TypeError: result.message is not a function

[Timeout] EqualityOperator
tsepi/src/primitives/countBits.ts:8:10
  */
 function countBits(x: number): number {
   let n = 0
-  while (x > 0) {
+  while (x >= 0) {
     n += x & 1
     x = x >> 1

[Killed] AssignmentOperator
tsepi/src/primitives/countBits.ts:9:5
 function countBits(x: number): number {
   let n = 0
   while (x > 0) {
-    n += x & 1
+    n -= x & 1
     x = x >> 1
   }
killedBy: countBits should count bits
statusReason: TypeError: result.message is not a function
