[Killed] BlockStatement
tsepi/src/primitives/parity.ts:15:44
  * Time: O(N) where N number of bits
  * Space: O(1)
  */
-export function parity1(x: number): number {
-  let r = 0
-  while (x > 0) {
-    r += x & 1
-    x >>= 1
-  }
-  return r % 2 === 0 ? 0 : 1
-}
+export function parity1(x: number): number {}
 
 /**
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] ConditionalExpression
tsepi/src/primitives/parity.ts:17:10
  */
 export function parity1(x: number): number {
   let r = 0
-  while (x > 0) {
+  while (false) {
     r += x & 1
     x >>= 1
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] EqualityOperator
tsepi/src/primitives/parity.ts:17:10
  */
 export function parity1(x: number): number {
   let r = 0
-  while (x > 0) {
+  while (x <= 0) {
     r += x & 1
     x >>= 1
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Survived] AssignmentOperator
tsepi/src/primitives/parity.ts:18:5
 export function parity1(x: number): number {
   let r = 0
   while (x > 0) {
-    r += x & 1
+    r -= x & 1
     x >>= 1
   }

[Killed] AssignmentOperator
tsepi/src/primitives/parity.ts:19:5
   let r = 0
   while (x > 0) {
     r += x & 1
-    x >>= 1
+    x <<= 1
   }
   return r % 2 === 0 ? 0 : 1
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] EqualityOperator
tsepi/src/primitives/parity.ts:21:10
     r += x & 1
     x >>= 1
   }
-  return r % 2 === 0 ? 0 : 1
+  return r % 2 !== 0 ? 0 : 1
 }
 
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] ConditionalExpression
tsepi/src/primitives/parity.ts:21:10
     r += x & 1
     x >>= 1
   }
-  return r % 2 === 0 ? 0 : 1
+  return false ? 0 : 1
 }
 
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] BlockStatement
tsepi/src/primitives/parity.ts:33:44
  * Time: O(N) where N number of bits
  * Space: O(1)
  */
-export function parity2(x: number): number {
-  let result = 0
-  while (x) {
-    result ^= x & 1
-    x >>= 1
-  }
-  return result
-}
+export function parity2(x: number): number {}
 
 /**
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] ConditionalExpression
tsepi/src/primitives/parity.ts:35:10
  */
 export function parity2(x: number): number {
   let result = 0
-  while (x) {
+  while (false) {
     result ^= x & 1
     x >>= 1
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Timeout] BlockStatement
tsepi/src/primitives/parity.ts:35:13
  */
 export function parity2(x: number): number {
   let result = 0
-  while (x) {
-    result ^= x & 1
-    x >>= 1
-  }
+  while (x) {}
   return result
 }

[Killed] AssignmentOperator
tsepi/src/primitives/parity.ts:37:5
   let result = 0
   while (x) {
     result ^= x & 1
-    x >>= 1
+    x <<= 1
   }
   return result
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Killed] BlockStatement
tsepi/src/primitives/parity.ts:49:44
  * Time: O(K) where K number of 1s
  * Space: O(1)
  */
-export function parity3(x: number): number {
-  let result = 0
-  while (x) {
-    result ^= 1
-    x &= x - 1
-  }
-  return result
-}
+export function parity3(x: number): number {}
 
 const PRECOMPUTED_PARITY: number[] = (() => {
killedBy: parity should count parity
statusReason: TypeError: matcherResult.message is not a function

[Timeout] BlockStatement
tsepi/src/primitives/parity.ts:51:13
  */
 export function parity3(x: number): number {
   let result = 0
-  while (x) {
-    result ^= 1
-    x &= x - 1
-  }
+  while (x) {}
   return result
 }

[Timeout] ArithmeticOperator
tsepi/src/primitives/parity.ts:53:10
   let result = 0
   while (x) {
     result ^= 1
-    x &= x - 1
+    x &= x + 1
   }
   return result

[Timeout] AssignmentOperator
tsepi/src/primitives/parity.ts:53:5
   let result = 0
   while (x) {
     result ^= 1
-    x &= x - 1
+    x |= x - 1
   }
   return result

[Killed] BlockStatement
tsepi/src/primitives/parity.ts:58:45
   return result
 }
 
-const PRECOMPUTED_PARITY: number[] = (() => {
-  const cache = []
-  for (let i = 0; i <= 3; i++) {
-    cache[i] = parity3(i)
-  }
-  return cache
-})()
+const PRECOMPUTED_PARITY: number[] = (() => {})()
 
 /**
killedBy: parity of 64bit integers should count parity
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Killed] ConditionalExpression
tsepi/src/primitives/parity.ts:60:19
 
 const PRECOMPUTED_PARITY: number[] = (() => {
   const cache = []
-  for (let i = 0; i <= 3; i++) {
+  for (let i = 0; false; i++) {
     cache[i] = parity3(i)
   }
killedBy: parity of 64bit integers should count parity
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/primitives/parity.ts:60:32
 
 const PRECOMPUTED_PARITY: number[] = (() => {
   const cache = []
-  for (let i = 0; i <= 3; i++) {
-    cache[i] = parity3(i)
-  }
+  for (let i = 0; i <= 3; i++) {}
   return cache
 })()
killedBy: parity of 64bit integers should count parity
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/primitives/parity.ts:72:44
  * Time: O(n/L) n - word size, L - cache word size
  * Space: O(1)
  */
-export function parity4(x: number): number {
-  const maskSize = 2
-  const bitMask = 0b11
-  return (
-    PRECOMPUTED_PARITY[x >> (3 * maskSize)] ^
-    PRECOMPUTED_PARITY[(x >> (2 * maskSize)) & bitMask] ^
-    PRECOMPUTED_PARITY[(x >> maskSize) & bitMask] ^
-    PRECOMPUTED_PARITY[x & bitMask]
-  )
-}
+export function parity4(x: number): number {}
 
 /**
killedBy: parity of 64bit integers should count parity
statusReason: TypeError: result.message is not a function

[Survived] ArithmeticOperator
tsepi/src/primitives/parity.ts:76:30
   const maskSize = 2
   const bitMask = 0b11
   return (
-    PRECOMPUTED_PARITY[x >> (3 * maskSize)] ^
+    PRECOMPUTED_PARITY[x >> (3 / maskSize)] ^
     PRECOMPUTED_PARITY[(x >> (2 * maskSize)) & bitMask] ^
     PRECOMPUTED_PARITY[(x >> maskSize) & bitMask] ^

[Killed] ArithmeticOperator
tsepi/src/primitives/parity.ts:77:31
   const bitMask = 0b11
   return (
     PRECOMPUTED_PARITY[x >> (3 * maskSize)] ^
-    PRECOMPUTED_PARITY[(x >> (2 * maskSize)) & bitMask] ^
+    PRECOMPUTED_PARITY[(x >> (2 / maskSize)) & bitMask] ^
     PRECOMPUTED_PARITY[(x >> maskSize) & bitMask] ^
     PRECOMPUTED_PARITY[x & bitMask]
killedBy: parity of 64bit integers should count parity
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/primitives/parity.ts:91:44
  * Time: O(log n), n - number of bits
  * Space: O(1)
  */
-export function parity5(x: number): number {
-  x ^= x >> 16
-  x ^= x >> 8
-  x ^= x >> 4
-  x ^= x >> 2
-  x ^= x >> 1
-  return x & 1
-}
+export function parity5(x: number): number {}
 
killedBy: parity of 32bit integers should count parity
statusReason: TypeError: result.message is not a function
