[Killed] BlockStatement
tsepi/src/primitives/swapper.ts:4:50
 /**
  * Swap numbers using bitwise operators.
  */
-function swapper(a: number, b: number): number[] {
-  a = a ^ b
-  b = b ^ a
-  a = a ^ b
-  return [a, b]
-}
+function swapper(a: number, b: number): number[] {}
 
 export default swapper
killedBy: swapper should swap number using bitwise operators
statusReason: TypeError: result.message is not a function
