[Killed] BlockStatement
tsepi/src/search/binarySearch.ts:9:66
  * Time: O(logN)
  * Space: O(1)
  */
-export default function binarySearch<T>(x: T, coll: T[]): number {
-  let [l, r] = [0, coll.length - 1]
-
-  while (l <= r) {
-    const m = Math.floor(l + (r - l) / 2)
-
-    if (x === coll[m]) {
-      return m
-    } else if (x > coll[m]) {
-      l = m + 1
-    } else {
-      r = m - 1
-    }
-  }
-
-  return -1
-}
+export default function binarySearch<T>(x: T, coll: T[]): number {}
 
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Survived] ArithmeticOperator
tsepi/src/search/binarySearch.ts:10:20
  * Space: O(1)
  */
 export default function binarySearch<T>(x: T, coll: T[]): number {
-  let [l, r] = [0, coll.length - 1]
+  let [l, r] = [0, coll.length + 1]
 
   while (l <= r) {

[Killed] ConditionalExpression
tsepi/src/search/binarySearch.ts:12:10
 export default function binarySearch<T>(x: T, coll: T[]): number {
   let [l, r] = [0, coll.length - 1]
 
-  while (l <= r) {
+  while (false) {
     const m = Math.floor(l + (r - l) / 2)
 
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/search/binarySearch.ts:12:10
 export default function binarySearch<T>(x: T, coll: T[]): number {
   let [l, r] = [0, coll.length - 1]
 
-  while (l <= r) {
+  while (l < r) {
     const m = Math.floor(l + (r - l) / 2)
 
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Killed] ArithmeticOperator
tsepi/src/search/binarySearch.ts:13:26
   let [l, r] = [0, coll.length - 1]
 
   while (l <= r) {
-    const m = Math.floor(l + (r - l) / 2)
+    const m = Math.floor(l - (r - l) / 2)
 
     if (x === coll[m]) {
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Timeout] ArithmeticOperator
tsepi/src/search/binarySearch.ts:13:30
   let [l, r] = [0, coll.length - 1]
 
   while (l <= r) {
-    const m = Math.floor(l + (r - l) / 2)
+    const m = Math.floor(l + (r - l) * 2)
 
     if (x === coll[m]) {

[Killed] ConditionalExpression
tsepi/src/search/binarySearch.ts:15:9
   while (l <= r) {
     const m = Math.floor(l + (r - l) / 2)
 
-    if (x === coll[m]) {
+    if (false) {
       return m
     } else if (x > coll[m]) {
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/search/binarySearch.ts:15:9
   while (l <= r) {
     const m = Math.floor(l + (r - l) / 2)
 
-    if (x === coll[m]) {
+    if (true) {
       return m
     } else if (x > coll[m]) {
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/search/binarySearch.ts:17:16
 
     if (x === coll[m]) {
       return m
-    } else if (x > coll[m]) {
+    } else if (x <= coll[m]) {
       l = m + 1
     } else {
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/search/binarySearch.ts:17:16
 
     if (x === coll[m]) {
       return m
-    } else if (x > coll[m]) {
+    } else if (true) {
       l = m + 1
     } else {
killedBy: binarySearch
statusReason: TypeError: result.message is not a function

[Timeout] ArithmeticOperator
tsepi/src/search/binarySearch.ts:18:11
     if (x === coll[m]) {
       return m
     } else if (x > coll[m]) {
-      l = m + 1
+      l = m - 1
     } else {
       r = m - 1

[Timeout] BlockStatement
tsepi/src/search/binarySearch.ts:19:12
       return m
     } else if (x > coll[m]) {
       l = m + 1
-    } else {
-      r = m - 1
-    }
+    } else {}
   }
 

[Timeout] ArithmeticOperator
tsepi/src/search/binarySearch.ts:20:11
     } else if (x > coll[m]) {
       l = m + 1
     } else {
-      r = m - 1
+      r = m + 1
     }
   }
