[Killed] BlockStatement
tsepi/src/search/firstLargerElement.ts:9:57
  * Time: O(logN)
  * Space: O(1)
  */
-function firstLargerElement<T>(x: T, coll: T[]): number {
-  let [l, r] = [0, coll.length - 1]
-
-  if (r === -1 || coll[r] <= x) {
-    return -1
-  }
-
-  while (l < r) {
-    const m = Math.floor(l + (r - l) / 2)
-    if (x <= coll[m]) {
-      r = m - 1
-    } else {
-      l = m + 1
-    }
-  }
-
-  while (x >= coll[l]) {
-    l += 1
-  }
-
-  return l
-}
+function firstLargerElement<T>(x: T, coll: T[]): number {}
 
 export default firstLargerElement
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] ArithmeticOperator
tsepi/src/search/firstLargerElement.ts:10:20
  * Space: O(1)
  */
 function firstLargerElement<T>(x: T, coll: T[]): number {
-  let [l, r] = [0, coll.length - 1]
+  let [l, r] = [0, coll.length + 1]
 
   if (r === -1 || coll[r] <= x) {
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/search/firstLargerElement.ts:12:19
 function firstLargerElement<T>(x: T, coll: T[]): number {
   let [l, r] = [0, coll.length - 1]
 
-  if (r === -1 || coll[r] <= x) {
+  if (r === -1 || false) {
     return -1
   }
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] LogicalOperator
tsepi/src/search/firstLargerElement.ts:12:7
 function firstLargerElement<T>(x: T, coll: T[]): number {
   let [l, r] = [0, coll.length - 1]
 
-  if (r === -1 || coll[r] <= x) {
+  if (r === -1 && coll[r] <= x) {
     return -1
   }
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] UnaryOperator
tsepi/src/search/firstLargerElement.ts:13:12
   let [l, r] = [0, coll.length - 1]
 
   if (r === -1 || coll[r] <= x) {
-    return -1
+    return +1
   }
 
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Survived] EqualityOperator
tsepi/src/search/firstLargerElement.ts:16:10
     return -1
   }
 
-  while (l < r) {
+  while (l <= r) {
     const m = Math.floor(l + (r - l) / 2)
     if (x <= coll[m]) {

[Survived] ConditionalExpression
tsepi/src/search/firstLargerElement.ts:16:10
     return -1
   }
 
-  while (l < r) {
+  while (false) {
     const m = Math.floor(l + (r - l) / 2)
     if (x <= coll[m]) {

[Killed] ArithmeticOperator
tsepi/src/search/firstLargerElement.ts:17:30
   }
 
   while (l < r) {
-    const m = Math.floor(l + (r - l) / 2)
+    const m = Math.floor(l + (r - l) * 2)
     if (x <= coll[m]) {
       r = m - 1
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Timeout] ArithmeticOperator
tsepi/src/search/firstLargerElement.ts:17:31
   }
 
   while (l < r) {
-    const m = Math.floor(l + (r - l) / 2)
+    const m = Math.floor(l + (r + l) / 2)
     if (x <= coll[m]) {
       r = m - 1

[Killed] ConditionalExpression
tsepi/src/search/firstLargerElement.ts:18:9
 
   while (l < r) {
     const m = Math.floor(l + (r - l) / 2)
-    if (x <= coll[m]) {
+    if (false) {
       r = m - 1
     } else {
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/search/firstLargerElement.ts:18:9
 
   while (l < r) {
     const m = Math.floor(l + (r - l) / 2)
-    if (x <= coll[m]) {
+    if (x > coll[m]) {
       r = m - 1
     } else {
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Timeout] ArithmeticOperator
tsepi/src/search/firstLargerElement.ts:19:11
   while (l < r) {
     const m = Math.floor(l + (r - l) / 2)
     if (x <= coll[m]) {
-      r = m - 1
+      r = m + 1
     } else {
       l = m + 1

[Timeout] BlockStatement
tsepi/src/search/firstLargerElement.ts:20:12
     const m = Math.floor(l + (r - l) / 2)
     if (x <= coll[m]) {
       r = m - 1
-    } else {
-      l = m + 1
-    }
+    } else {}
   }
 

[Timeout] ArithmeticOperator
tsepi/src/search/firstLargerElement.ts:21:11
     if (x <= coll[m]) {
       r = m - 1
     } else {
-      l = m + 1
+      l = m - 1
     }
   }

[Killed] EqualityOperator
tsepi/src/search/firstLargerElement.ts:25:10
     }
   }
 
-  while (x >= coll[l]) {
+  while (x < coll[l]) {
     l += 1
   }
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/search/firstLargerElement.ts:25:10
     }
   }
 
-  while (x >= coll[l]) {
+  while (false) {
     l += 1
   }
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function

[Killed] AssignmentOperator
tsepi/src/search/firstLargerElement.ts:26:5
   }
 
   while (x >= coll[l]) {
-    l += 1
+    l -= 1
   }
 
killedBy: firstLargerElement
statusReason: TypeError: result.message is not a function
