[Killed] BlockStatement
tsepi/src/stack/Stack.ts:11:17
 export default class Stack<T> {
   private ll: LinkedList<T>
 
-  constructor() {
-    this.ll = new LinkedList()
-  }
+  constructor() {}
 
   /**
killedBy: Stack should support push and pop
statusReason: TypeError: Cannot read properties of undefined (reading 'prepend')

[Killed] BlockStatement
tsepi/src/stack/Stack.ts:21:25
    * Time: O(1)
    * Space: O(1)
    */
-  public push(value: T) {
-    this.ll.prepend(value)
-  }
+  public push(value: T) {}
 
   /**
killedBy: Stack should support push and pop
statusReason: Error: StackIsEmptyError

[Killed] BlockStatement
tsepi/src/stack/Stack.ts:31:19
    * Time: O(1)
    * Space: O(1)
    */
-  public pop(): T {
-    if (!this.ll.head) {
-      throw new Error('StackIsEmptyError')
-    }
-
-    const value = this.ll.head.value
-    this.ll.remove(0)
-    return value
-  }
+  public pop(): T {}
 }
 
killedBy: Stack should support push and pop
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/stack/Stack.ts:32:9
    * Space: O(1)
    */
   public pop(): T {
-    if (!this.ll.head) {
+    if (true) {
       throw new Error('StackIsEmptyError')
     }
killedBy: Stack should support push and pop
statusReason: Error: StackIsEmptyError

[Killed] ConditionalExpression
tsepi/src/stack/Stack.ts:32:9
    * Space: O(1)
    */
   public pop(): T {
-    if (!this.ll.head) {
+    if (false) {
       throw new Error('StackIsEmptyError')
     }
killedBy: Stack should throw an error if pop on empty
statusReason: TypeError: result.message is not a function
