[Killed] BlockStatement
tsepi/src/std/filter.ts:11:59
  * @param coll - The collection to iterate over.
  * @returns coll - The new collection.
  */
-function filter<T>(iteratee: Iteratee<T>, coll: T[]): T[] {
-  const res = [] as T[]
-  for (let i = 0; i < coll.length; i += 1) {
-    const x = coll[i]
-    if (iteratee(x, i)) {
-      res.push(x)
-    }
-  }
-  return res
-}
+function filter<T>(iteratee: Iteratee<T>, coll: T[]): T[] {}
 
 export default filter
killedBy: anonymousLetter
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
tsepi/src/std/filter.ts:13:44
  */
 function filter<T>(iteratee: Iteratee<T>, coll: T[]): T[] {
   const res = [] as T[]
-  for (let i = 0; i < coll.length; i += 1) {
-    const x = coll[i]
-    if (iteratee(x, i)) {
-      res.push(x)
-    }
-  }
+  for (let i = 0; i < coll.length; i += 1) {}
   return res
 }
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/std/filter.ts:13:19
  */
 function filter<T>(iteratee: Iteratee<T>, coll: T[]): T[] {
   const res = [] as T[]
-  for (let i = 0; i < coll.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const x = coll[i]
     if (iteratee(x, i)) {
killedBy: anonymousLetter
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/std/filter.ts:15:25
   const res = [] as T[]
   for (let i = 0; i < coll.length; i += 1) {
     const x = coll[i]
-    if (iteratee(x, i)) {
-      res.push(x)
-    }
+    if (iteratee(x, i)) {}
   }
   return res
killedBy: filter
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/std/filter.ts:15:9
   const res = [] as T[]
   for (let i = 0; i < coll.length; i += 1) {
     const x = coll[i]
-    if (iteratee(x, i)) {
+    if (true) {
       res.push(x)
     }
killedBy: filter
statusReason: TypeError: result.message is not a function
