[Killed] BlockStatement
tsepi/src/std/forEach.ts:12:76
  * @param coll - The collection to iterate.
  * @returns void
  */
-export default function forEAch<A>(iteratee: Iteratee<A>, coll: A[]): void {
-  for (let i = 0; i < coll.length; i += 1) {
-    const shouldStop = iteratee(coll[i], i)
-    if (shouldStop === false) {
-      break
-    }
-  }
-}
+export default function forEAch<A>(iteratee: Iteratee<A>, coll: A[]): void {}
 
killedBy: forEach should iterate over collection
statusReason: TypeError: result.message is not a function

[Killed] EqualityOperator
tsepi/src/std/forEach.ts:13:19
  * @returns void
  */
 export default function forEAch<A>(iteratee: Iteratee<A>, coll: A[]): void {
-  for (let i = 0; i < coll.length; i += 1) {
+  for (let i = 0; i >= coll.length; i += 1) {
     const shouldStop = iteratee(coll[i], i)
     if (shouldStop === false) {
killedBy: forEach should iterate over collection
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/std/forEach.ts:13:19
  * @returns void
  */
 export default function forEAch<A>(iteratee: Iteratee<A>, coll: A[]): void {
-  for (let i = 0; i < coll.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const shouldStop = iteratee(coll[i], i)
     if (shouldStop === false) {
killedBy: forEach should iterate over collection
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/std/forEach.ts:15:9
 export default function forEAch<A>(iteratee: Iteratee<A>, coll: A[]): void {
   for (let i = 0; i < coll.length; i += 1) {
     const shouldStop = iteratee(coll[i], i)
-    if (shouldStop === false) {
+    if (true) {
       break
     }
killedBy: MaxStack should support max list
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/std/forEach.ts:15:24
 export default function forEAch<A>(iteratee: Iteratee<A>, coll: A[]): void {
   for (let i = 0; i < coll.length; i += 1) {
     const shouldStop = iteratee(coll[i], i)
-    if (shouldStop === false) {
+    if (shouldStop === true) {
       break
     }
killedBy: forEach should stop if explicitly returned false
statusReason: TypeError: result.message is not a function
