[Killed] BlockStatement
tsepi/src/std/map.ts:13:77
  *
  * @returns collection - collection with transformed values.
  */
-export default function map<A, B>(iteratee: Iteratee<A, B>, coll: A[]): B[] {
-  const result: B[] = []
-  for (let i = 0; i < coll.length; i += 1) {
-    const x = coll[i]
-    result.push(iteratee(x, i))
-  }
-  return result
-}
+export default function map<A, B>(iteratee: Iteratee<A, B>, coll: A[]): B[] {}
 
killedBy: zip
statusReason: TypeError: result.message is not a function

[Killed] ConditionalExpression
tsepi/src/std/map.ts:15:19
  */
 export default function map<A, B>(iteratee: Iteratee<A, B>, coll: A[]): B[] {
   const result: B[] = []
-  for (let i = 0; i < coll.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     const x = coll[i]
     result.push(iteratee(x, i))
killedBy: MaxStack should support max list
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
tsepi/src/std/map.ts:15:44
  */
 export default function map<A, B>(iteratee: Iteratee<A, B>, coll: A[]): B[] {
   const result: B[] = []
-  for (let i = 0; i < coll.length; i += 1) {
-    const x = coll[i]
-    result.push(iteratee(x, i))
-  }
+  for (let i = 0; i < coll.length; i += 1) {}
   return result
 }
killedBy: MaxStack should support max list
statusReason: TypeError: Cannot read properties of undefined (reading '0')
