[Killed] BlockStatement
tsepi/src/std/reduce.ts:12:101
  *
  * @returns acc - accumulated value.
  */
-export default function reduce<A, B>(reducer: (acc: B, item: A) => B, coll: A[], accDefault?: B): B {
-  if (!accDefault) {
-    const [head, ...tail] = coll
-    return reduce(reducer, tail, (head as unknown) as B)
-  }
-
-  let acc = accDefault
-  for (const item of coll) {
-    acc = reducer(acc, item)
-  }
-  return acc
-}
+export default function reduce<A, B>(reducer: (acc: B, item: A) => B, coll: A[], accDefault?: B): B {}
 
killedBy: reduce
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/std/reduce.ts:13:20
  * @returns acc - accumulated value.
  */
 export default function reduce<A, B>(reducer: (acc: B, item: A) => B, coll: A[], accDefault?: B): B {
-  if (!accDefault) {
-    const [head, ...tail] = coll
-    return reduce(reducer, tail, (head as unknown) as B)
-  }
+  if (!accDefault) {}
 
   let acc = accDefault
killedBy: reduce
statusReason: TypeError: result.message is not a function

[Killed] BooleanLiteral
tsepi/src/std/reduce.ts:13:7
  * @returns acc - accumulated value.
  */
 export default function reduce<A, B>(reducer: (acc: B, item: A) => B, coll: A[], accDefault?: B): B {
-  if (!accDefault) {
+  if (accDefault) {
     const [head, ...tail] = coll
     return reduce(reducer, tail, (head as unknown) as B)
killedBy: reduce
statusReason: TypeError: result.message is not a function

[Killed] BlockStatement
tsepi/src/std/reduce.ts:19:28
   }
 
   let acc = accDefault
-  for (const item of coll) {
-    acc = reducer(acc, item)
-  }
+  for (const item of coll) {}
   return acc
 }
killedBy: reduce
statusReason: TypeError: result.message is not a function
