[Killed] BlockStatement
tsepi/src/std/swap.ts:1:58
-function swap<T>(array: T[], i: number, j: number): void {
-  const temp = array[i]
-  array[i] = array[j]
-  array[j] = temp
-}
+function swap<T>(array: T[], i: number, j: number): void {}
 
 export default swap
killedBy: rearrange
statusReason: TypeError: result.message is not a function
