[Killed] BlockStatement
tsepi/src/std/zip.ts:11:42
  *
  * @returns array - array of arrays of size 2.
  */
-function zip<A, B>(arr1: A[], arr2: B[]) {
-  return map((v, i) => {
-    return [v, arr2[i]]
-  }, arr1)
-}
+function zip<A, B>(arr1: A[], arr2: B[]) {}
 
 export default zip
killedBy: MaxStack should support max list
statusReason: TypeError: Cannot read properties of undefined (reading '4')

[Killed] BlockStatement
tsepi/src/std/zip.ts:12:24
  * @returns array - array of arrays of size 2.
  */
 function zip<A, B>(arr1: A[], arr2: B[]) {
-  return map((v, i) => {
-    return [v, arr2[i]]
-  }, arr1)
+  return map((v, i) => {}, arr1)
 }
 
killedBy: zip
statusReason: TypeError: result.message is not a function
